app/Controllers/RegistrationController.php

    public function loginStudent()
    {
        $session = session();
        $expertModel = new Teachers_model();
        $studentModel = new Students_model();
        $email = $this->request->getVar('email');
        /*        $password = $this->request->getVar('password');*/

        $data = $expertModel->where('email', $email)->first();
        $data2 = $studentModel->where('email', $email)->first();
---
SELECT *
FROM `students`
WHERE `email` = ''
 LIMIT 1