app/Models/ExerciseModel.php

    public function getExercises($id_exercise = false)
    {
        if ($id_exercise === false) {
            return $this->findAll();
---
SELECT *
FROM `exercises`