app/Models/Teachers_model.php

    public function edit_teacher($data)
    {
        $builder = $this->db->table('teachers');
        $builder->where('idTeachers', $data['idTeachers']);
        $builder->update($data);
---
UPDATE `teachers` SET `idTeachers` = '11', `firstname` = 'stefano', `lastname` = 'potato', `isActive` = 0, `email` = 'ayy@gmail.netters'
WHERE `idTeachers` = '11'